tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/pt_regs.h
/**
 * @file
 * @brief   Type definitions for the Pulse Train Engine.
 *
 */
/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2017-02-16 08:46:02 -0600 (Thu, 16 Feb 2017) $
 * $Revision: 26453 $
 *
 **************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_PT_REGS_H_
#define _MXC_PT_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif


///@cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
///@endcond

/**
 * @ingroup     pulsetrain
 * @defgroup    pulsetrain_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions
 * @{
 */

/**
 * Structure type for the Pulse Train Global module registers allowing direct 32-bit access to each register.
 */
 typedef struct {
    __IO uint32_t enable;                               /**< <b><tt>0x0000:</tt></b> \c PTG_ENABLE Register - Global Enable/Disable Controls for All Pulse Trains. */
    __IO uint32_t resync;                               /**< <b><tt>0x0004:</tt></b> \c PTG_RESYNC Register - Global Resync (All Pulse Trains) Control.            */
    __IO uint32_t intfl;                                /**< <b><tt>0x0008:</tt></b> \c PTG_INTFL Register - Pulse Train Interrupt Flags.                          */
    __IO uint32_t inten;                                /**< <b><tt>0x000C:</tt></b> \c PTG_INTEN Register - Pulse Train Interrupt Enable/Disable.                 */
} mxc_ptg_regs_t;

/**
 * Structure type for the Pulse Train configuration registers allowing direct 32-bit access to each register.
 */
typedef struct {
    __IO uint32_t rate_length;                          /**< <b><tt>0x0000:</tt></b>\c PT_RATE_LENGTH Register - Pulse Train Configuration.           */
    __IO uint32_t train;                                /**< <b><tt>0x0004:</tt></b>\c PT_TRAIN Register - Pulse Train Output Pattern.                */
    __IO uint32_t loop;                                 /**< <b><tt>0x0008:</tt></b>\c PT_LOOP Register - Pulse Train Loop Configuration.             */
    __IO uint32_t restart;                              /**< <b><tt>0x000C:</tt></b>\c PT_RESTART Register - Pulse Train Auto-Restart Configuration.  */
} mxc_pt_regs_t;
/**@} end of pulsetrain_registers group*/

/*
   Register offsets for module PT.
*/
/**
 * @ingroup    pulsetrain_registers
 * @defgroup   PTG_Register_Offsets Global Register Offsets
 * @brief      Pluse Train Global Control Register Offsets from the Pulse Train Global Base Peripheral Address. 
 * @{
 */
#define MXC_R_PTG_OFFS_ENABLE                               ((uint32_t)0x00000000UL)    /**< Offset from the PTG Base Peripheral Address:<b><tt>0x0000</tt></b> */
#define MXC_R_PTG_OFFS_RESYNC                               ((uint32_t)0x00000004UL)    /**< Offset from the PTG Base Peripheral Address:<b><tt>0x0004</tt></b> */
#define MXC_R_PTG_OFFS_INTFL                                ((uint32_t)0x00000008UL)    /**< Offset from the PTG Base Peripheral Address:<b><tt>0x0008</tt></b> */
#define MXC_R_PTG_OFFS_INTEN                                ((uint32_t)0x0000000CUL)    /**< Offset from the PTG Base Peripheral Address:<b><tt>0x000C</tt></b> */
/**@} end of group PTG_Register_Offsets*/
/**
 * @ingroup    pulsetrain_registers
 * @defgroup   PT_Register_Offsets Register Offsets: Configuration
 * @brief      Pluse Train Configuration Register Offsets from the Pulse Train Base Peripheral Address. 
 * @{
 */  
#define MXC_R_PT_OFFS_RATE_LENGTH                           ((uint32_t)0x00000000UL)    /**< Offset from the PT Base Peripheral Address:<b><tt>0x0000</tt></b> */
#define MXC_R_PT_OFFS_TRAIN                                 ((uint32_t)0x00000004UL)    /**< Offset from the PT Base Peripheral Address:<b><tt>0x0004</tt></b> */
#define MXC_R_PT_OFFS_LOOP                                  ((uint32_t)0x00000008UL)    /**< Offset from the PT Base Peripheral Address:<b><tt>0x0008</tt></b> */
#define MXC_R_PT_OFFS_RESTART                               ((uint32_t)0x0000000CUL)    /**< Offset from the PT Base Peripheral Address:<b><tt>0x000C</tt></b> */
/**@} end of group PT_Register_Offsets*/

