tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/pt_regs.h
/*
   Field positions and masks for module PT.
*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_ENABLE_Register PT_ENABLE
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_ENABLE_PT0_POS                             0                                                       /**< PT0 Position */
#define MXC_F_PT_ENABLE_PT0                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT0_POS))   /**< PT0 Mask     */
#define MXC_F_PT_ENABLE_PT1_POS                             1                                                       /**< PT1 Position */
#define MXC_F_PT_ENABLE_PT1                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT1_POS))   /**< PT1 Mask     */
#define MXC_F_PT_ENABLE_PT2_POS                             2                                                       /**< PT2 Position */
#define MXC_F_PT_ENABLE_PT2                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT2_POS))   /**< PT2 Mask     */
#define MXC_F_PT_ENABLE_PT3_POS                             3                                                       /**< PT3 Position */
#define MXC_F_PT_ENABLE_PT3                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT3_POS))   /**< PT3 Mask     */
#define MXC_F_PT_ENABLE_PT4_POS                             4                                                       /**< PT4 Position */
#define MXC_F_PT_ENABLE_PT4                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT4_POS))   /**< PT4 Mask     */
#define MXC_F_PT_ENABLE_PT5_POS                             5                                                       /**< PT5 Position */
#define MXC_F_PT_ENABLE_PT5                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT5_POS))   /**< PT5 Mask     */
#define MXC_F_PT_ENABLE_PT6_POS                             6                                                       /**< PT6 Position */
#define MXC_F_PT_ENABLE_PT6                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT6_POS))   /**< PT6 Mask     */
#define MXC_F_PT_ENABLE_PT7_POS                             7                                                       /**< PT7 Position */
#define MXC_F_PT_ENABLE_PT7                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT7_POS))   /**< PT7 Mask     */
#define MXC_F_PT_ENABLE_PT8_POS                             8                                                       /**< PT8 Position */
#define MXC_F_PT_ENABLE_PT8                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT8_POS))   /**< PT8 Mask     */
#define MXC_F_PT_ENABLE_PT9_POS                             9                                                       /**< PT9 Position */
#define MXC_F_PT_ENABLE_PT9                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT9_POS))   /**< PT9 Mask     */
#define MXC_F_PT_ENABLE_PT10_POS                            10                                                      /**< PT10 Position */
#define MXC_F_PT_ENABLE_PT10                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT10_POS))  /**< PT10 Mask     */
#define MXC_F_PT_ENABLE_PT11_POS                            11                                                      /**< PT11 Position */
#define MXC_F_PT_ENABLE_PT11                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT11_POS))  /**< PT11 Mask     */
#define MXC_F_PT_ENABLE_PT12_POS                            12                                                      /**< PT12 Position */
#define MXC_F_PT_ENABLE_PT12                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT12_POS))  /**< PT12 Mask     */
#define MXC_F_PT_ENABLE_PT13_POS                            13                                                      /**< PT13 Position */
#define MXC_F_PT_ENABLE_PT13                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT13_POS))  /**< PT13 Mask     */
#define MXC_F_PT_ENABLE_PT14_POS                            14                                                      /**< PT14 Position */
#define MXC_F_PT_ENABLE_PT14                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT14_POS))  /**< PT14 Mask     */
#define MXC_F_PT_ENABLE_PT15_POS                            15                                                      /**< PT15 Position */
#define MXC_F_PT_ENABLE_PT15                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT15_POS))  /**< PT15 Mask     */
/**@} PT_ENABLE_Register*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_RESYNC_Register PT_RESYNC
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_RESYNC_PT0_POS                             0                                                       /**< PT0 Position */
#define MXC_F_PT_RESYNC_PT0                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT0_POS))   /**< PT0 Mask     */
#define MXC_F_PT_RESYNC_PT1_POS                             1                                                       /**< PT1 Position */
#define MXC_F_PT_RESYNC_PT1                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT1_POS))   /**< PT1 Mask     */
#define MXC_F_PT_RESYNC_PT2_POS                             2                                                       /**< PT2 Position */
#define MXC_F_PT_RESYNC_PT2                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT2_POS))   /**< PT2 Mask     */
#define MXC_F_PT_RESYNC_PT3_POS                             3                                                       /**< PT3 Position */
#define MXC_F_PT_RESYNC_PT3                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT3_POS))   /**< PT3 Mask     */
#define MXC_F_PT_RESYNC_PT4_POS                             4                                                       /**< PT4 Position */
#define MXC_F_PT_RESYNC_PT4                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT4_POS))   /**< PT4 Mask     */
#define MXC_F_PT_RESYNC_PT5_POS                             5                                                       /**< PT5 Position */
#define MXC_F_PT_RESYNC_PT5                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT5_POS))   /**< PT5 Mask     */
#define MXC_F_PT_RESYNC_PT6_POS                             6                                                       /**< PT6 Position */
#define MXC_F_PT_RESYNC_PT6                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT6_POS))   /**< PT6 Mask     */
#define MXC_F_PT_RESYNC_PT7_POS                             7                                                       /**< PT7 Position */
#define MXC_F_PT_RESYNC_PT7                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT7_POS))   /**< PT7 Mask     */
#define MXC_F_PT_RESYNC_PT8_POS                             8                                                       /**< PT8 Position */
#define MXC_F_PT_RESYNC_PT8                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT8_POS))   /**< PT8 Mask     */
#define MXC_F_PT_RESYNC_PT9_POS                             9                                                       /**< PT9 Position */
#define MXC_F_PT_RESYNC_PT9                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT9_POS))   /**< PT9 Mask     */
#define MXC_F_PT_RESYNC_PT10_POS                            10                                                      /**< PT10 Position */
#define MXC_F_PT_RESYNC_PT10                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT10_POS))  /**< PT10 Mask     */
#define MXC_F_PT_RESYNC_PT11_POS                            11                                                      /**< PT11 Position */
#define MXC_F_PT_RESYNC_PT11                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT11_POS))  /**< PT11 Mask     */
#define MXC_F_PT_RESYNC_PT12_POS                            12                                                      /**< PT12 Position */
#define MXC_F_PT_RESYNC_PT12                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT12_POS))  /**< PT12 Mask     */
#define MXC_F_PT_RESYNC_PT13_POS                            13                                                      /**< PT13 Position */
#define MXC_F_PT_RESYNC_PT13                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT13_POS))  /**< PT13 Mask     */
#define MXC_F_PT_RESYNC_PT14_POS                            14                                                      /**< PT14 Position */
#define MXC_F_PT_RESYNC_PT14                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT14_POS))  /**< PT14 Mask     */
#define MXC_F_PT_RESYNC_PT15_POS                            15                                                      /**< PT15 Position */
#define MXC_F_PT_RESYNC_PT15                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT15_POS))  /**< PT15 Mask     */
/**@} PT_RESYNC_Register*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_INTFL_Register PT_INTFL
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_INTFL_PT0_POS                              0                                                       /**< PT0 Position */
#define MXC_F_PT_INTFL_PT0                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT0_POS))    /**< PT0 Mask     */
#define MXC_F_PT_INTFL_PT1_POS                              1                                                       /**< PT1 Position */
#define MXC_F_PT_INTFL_PT1                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT1_POS))    /**< PT1 Mask     */
#define MXC_F_PT_INTFL_PT2_POS                              2                                                       /**< PT2 Position */
#define MXC_F_PT_INTFL_PT2                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT2_POS))    /**< PT2 Mask     */
#define MXC_F_PT_INTFL_PT3_POS                              3                                                       /**< PT3 Position */
#define MXC_F_PT_INTFL_PT3                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT3_POS))    /**< PT3 Mask     */
#define MXC_F_PT_INTFL_PT4_POS                              4                                                       /**< PT4 Position */
#define MXC_F_PT_INTFL_PT4                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT4_POS))    /**< PT4 Mask     */
#define MXC_F_PT_INTFL_PT5_POS                              5                                                       /**< PT5 Position */
#define MXC_F_PT_INTFL_PT5                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT5_POS))    /**< PT5 Mask     */
#define MXC_F_PT_INTFL_PT6_POS                              6                                                       /**< PT6 Position */
#define MXC_F_PT_INTFL_PT6                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT6_POS))    /**< PT6 Mask     */
#define MXC_F_PT_INTFL_PT7_POS                              7                                                       /**< PT7 Position */
#define MXC_F_PT_INTFL_PT7                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT7_POS))    /**< PT7 Mask     */
#define MXC_F_PT_INTFL_PT8_POS                              8                                                       /**< PT8 Position */
#define MXC_F_PT_INTFL_PT8                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT8_POS))    /**< PT8 Mask     */
#define MXC_F_PT_INTFL_PT9_POS                              9                                                       /**< PT9 Position */
#define MXC_F_PT_INTFL_PT9                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT9_POS))    /**< PT9 Mask     */
#define MXC_F_PT_INTFL_PT10_POS                             10                                                      /**< PT10 Position */
#define MXC_F_PT_INTFL_PT10                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT10_POS))   /**< PT10 Mask     */
#define MXC_F_PT_INTFL_PT11_POS                             11                                                      /**< PT11 Position */
#define MXC_F_PT_INTFL_PT11                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT11_POS))   /**< PT11 Mask     */
#define MXC_F_PT_INTFL_PT12_POS                             12                                                      /**< PT12 Position */
#define MXC_F_PT_INTFL_PT12                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT12_POS))   /**< PT12 Mask     */
#define MXC_F_PT_INTFL_PT13_POS                             13                                                      /**< PT13 Position */
#define MXC_F_PT_INTFL_PT13                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT13_POS))   /**< PT13 Mask     */
#define MXC_F_PT_INTFL_PT14_POS                             14                                                      /**< PT14 Position */
#define MXC_F_PT_INTFL_PT14                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT14_POS))   /**< PT14 Mask     */
#define MXC_F_PT_INTFL_PT15_POS                             15                                                      /**< PT15 Position */
#define MXC_F_PT_INTFL_PT15                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT15_POS))   /**< PT15 Mask     */
/**@} PT_INTFL_Register*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_INTEN_Register PT_INTEN
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_INTEN_PT0_POS                              0                                                       /**< PT0 Position */
#define MXC_F_PT_INTEN_PT0                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT0_POS))    /**< PT0 Mask     */
#define MXC_F_PT_INTEN_PT1_POS                              1                                                       /**< PT1 Position */
#define MXC_F_PT_INTEN_PT1                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT1_POS))    /**< PT1 Mask     */
#define MXC_F_PT_INTEN_PT2_POS                              2                                                       /**< PT2 Position */
#define MXC_F_PT_INTEN_PT2                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT2_POS))    /**< PT2 Mask     */
#define MXC_F_PT_INTEN_PT3_POS                              3                                                       /**< PT3 Position */
#define MXC_F_PT_INTEN_PT3                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT3_POS))    /**< PT3 Mask     */
#define MXC_F_PT_INTEN_PT4_POS                              4                                                       /**< PT4 Position */
#define MXC_F_PT_INTEN_PT4                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT4_POS))    /**< PT4 Mask     */
#define MXC_F_PT_INTEN_PT5_POS                              5                                                       /**< PT5 Position */
#define MXC_F_PT_INTEN_PT5                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT5_POS))    /**< PT5 Mask     */
#define MXC_F_PT_INTEN_PT6_POS                              6                                                       /**< PT6 Position */
#define MXC_F_PT_INTEN_PT6                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT6_POS))    /**< PT6 Mask     */
#define MXC_F_PT_INTEN_PT7_POS                              7                                                       /**< PT7 Position */
#define MXC_F_PT_INTEN_PT7                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT7_POS))    /**< PT7 Mask     */
#define MXC_F_PT_INTEN_PT8_POS                              8                                                       /**< PT8 Position */
#define MXC_F_PT_INTEN_PT8                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT8_POS))    /**< PT8 Mask     */
#define MXC_F_PT_INTEN_PT9_POS                              9                                                       /**< PT9 Position */
#define MXC_F_PT_INTEN_PT9                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT9_POS))    /**< PT9 Mask     */
#define MXC_F_PT_INTEN_PT10_POS                             10                                                      /**< PT10 Position*/
#define MXC_F_PT_INTEN_PT10                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT10_POS))   /**< PT10 Mask    */
#define MXC_F_PT_INTEN_PT11_POS                             11                                                      /**< PT11 Position*/
#define MXC_F_PT_INTEN_PT11                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT11_POS))   /**< PT11 Mask    */
#define MXC_F_PT_INTEN_PT12_POS                             12                                                      /**< PT12 Position*/
#define MXC_F_PT_INTEN_PT12                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT12_POS))   /**< PT12 Mask    */
#define MXC_F_PT_INTEN_PT13_POS                             13                                                      /**< PT13 Position*/
#define MXC_F_PT_INTEN_PT13                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT13_POS))   /**< PT13 Mask    */
#define MXC_F_PT_INTEN_PT14_POS                             14                                                      /**< PT14 Position*/
#define MXC_F_PT_INTEN_PT14                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT14_POS))   /**< PT14 Mask    */
#define MXC_F_PT_INTEN_PT15_POS                             15                                                      /**< PT15 Position*/
#define MXC_F_PT_INTEN_PT15                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT15_POS))   /**< PT15 Mask    */
/**@} PT_INTEN_Register*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_RATE_LENGTH_Register PT_RATE_LENGTH
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_RATE_LENGTH_RATE_CONTROL_POS               0                                                                   /**< RATE_CONTROL Position */
#define MXC_F_PT_RATE_LENGTH_RATE_CONTROL                   ((uint32_t)(0x07FFFFFFUL << MXC_F_PT_RATE_LENGTH_RATE_CONTROL_POS)) /**< RATE_CONTROL Mask */
#define MXC_F_PT_RATE_LENGTH_MODE_POS                       27                                                                  /**< MODE Position */
#define MXC_F_PT_RATE_LENGTH_MODE                           ((uint32_t)(0x0000001FUL << MXC_F_PT_RATE_LENGTH_MODE_POS))         /**< MODE Mask */
/**@} PT_RATE_Register*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_LOOP_Register PT_LOOP
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_LOOP_COUNT_POS                             0                                                       /**< COUNT Position */
#define MXC_F_PT_LOOP_COUNT                                 ((uint32_t)(0x0000FFFFUL << MXC_F_PT_LOOP_COUNT_POS))   /**< COUNT Mask */
#define MXC_F_PT_LOOP_DELAY_POS                             16                                                      /**< DELAY Position */
#define MXC_F_PT_LOOP_DELAY                                 ((uint32_t)(0x00000FFFUL << MXC_F_PT_LOOP_DELAY_POS))   /**< DELAY Mask */
/**@}PT_LOOP_Register*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_RESTART_Register PT_RESTART
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_RESTART_PT_X_SELECT_POS                    0                                                                     /**< PT_X_SELECT Position */
#define MXC_F_PT_RESTART_PT_X_SELECT                        ((uint32_t)(0x0000001FUL << MXC_F_PT_RESTART_PT_X_SELECT_POS))        /**< PT_X_SELECT Mask */
#define MXC_F_PT_RESTART_ON_PT_X_LOOP_EXIT_POS              7                                                                     /**< ON_PT_X_LOOP_EXIT Position */
#define MXC_F_PT_RESTART_ON_PT_X_LOOP_EXIT                  ((uint32_t)(0x00000001UL << MXC_F_PT_RESTART_ON_PT_X_LOOP_EXIT_POS))  /**< ON_PT_X_LOOP_EXIT Mask */
#define MXC_F_PT_RESTART_PT_Y_SELECT_POS                    8                                                                     /**< PT_Y_SELECT Position */
#define MXC_F_PT_RESTART_PT_Y_SELECT                        ((uint32_t)(0x0000001FUL << MXC_F_PT_RESTART_PT_Y_SELECT_POS))        /**< PT_Y_SELECT Mask */
#define MXC_F_PT_RESTART_ON_PT_Y_LOOP_EXIT_POS              15                                                                    /**< ON_PT_Y_LOOP_EXIT Position */
#define MXC_F_PT_RESTART_ON_PT_Y_LOOP_EXIT                  ((uint32_t)(0x00000001UL << MXC_F_PT_RESTART_ON_PT_Y_LOOP_EXIT_POS))  /**< ON_PT_Y_LOOP_EXIT Mask */
/**@} PT_RESTART_Register */


